{
    "id": 3,
    "title": "Easy Apple Crisp",
    "description": "Our easy Apple Crisp Recipe is a classic dessert loaded with freshly sliced apples that bubble up through a crunchy, crisp, and buttery cinnamon oat topping. Just as irresistible as apple pie, but so simple and quick to make, perfect for feeding a crowd with a generous scoop of vanilla ice cream.",
    "image": "images/apple-crisp.jpg",
    "time": "1 hour 15 mins",
    "difficulty": "Easy",
    "category": "Desserts",
    "youtubeId": "xWENtTrFjXk",
    "tags": ["apple", "dessert", "oats", "cinnamon", "comfort food", "fall", "autumn"],
    "servings": 8,
    "prepTime": "20 mins",
    "cookTime": "45 mins",
    "totalTime": "1 hour 5 mins",
    "lastUpdated": "2025-08-12",
    "version": "2.0",
    "defaultUnits": "metric",
    "ingredients": [
        "For the Apple Filling:",
        "1kg firm-crisp apples (6-7 medium apples), peeled and sliced",
        "15ml fresh lemon juice",
        "85g granulated sugar (or to taste)",
        "15g all-purpose flour",
        "1 tsp ground cinnamon",        
        "",
        "For the Crumb/Crisp Topping:",
        "140g all-purpose flour",
        "55g soft brown sugar (demerara)",
        "20g granulated sugar",
        "1.5 tsp ground cinnamon",
        "0.75 tsp salt",
        "110g unsalted butter (room temperature), plus extra for pan",
        "40g old-fashioned rolled oats"
    ],
    "instructions": [
    "Generously butter a 23cm pie pan with a bit of extra butter and preheat your oven to 190°C. The buttered dish will help prevent sticking and make serving easier.",
    "",
    "APPLE PREPARATION:",
    "Peel, core, and thinly slice your apples. You should have about 7-8 cups of beautiful sliced apples when finished.",
    "Transfer the sliced apples to a large bowl and squeeze 15ml of fresh lemon juice over them, tossing gently to coat. This prevents browning and adds a lovely bright flavor that balances the sweetness.",
    "Toss to combine, giving your apples an extra layer of warm, sweet flavor.",
    "",
    "COATING THE APPLES:",
    "In a separate bowl, stir together the granulated sugar, flour, and cinnamon until well combined. The flour helps thicken the juices while the cinnamon adds that perfect warm spice.",
    "Sprinkle this mixture over your lemon-coated apples and toss everything together until the apples are evenly coated with the sweet, spiced mixture.",
    "Transfer the seasoned apples to your buttered pie pan, mounding them slightly in the center to create a beautiful dome shape.",
    "",
    "CREATING THE PERFECT TOPPING:",
    "In a large mixing bowl, combine the flour, oats, both brown and granulated sugars, cinnamon, and salt. Mix these dry ingredients together with your hands to distribute everything evenly.",
    "Add the room temperature diced butter to the mixture and work it in with your hands, rubbing and mixing until pea-sized crumbs form throughout. The mixture should look crumbly and feel slightly moist.",
    "Spread this gorgeous crumb topping evenly over your prepared apples, making sure to cover them completely for that perfect crispy layer.",
    "",
    "BAKING TO PERFECTION:",
        "Place the pie pan on the center rack of your preheated oven and bake uncovered for 40-45 minutes, until the topping turns golden brown and crispy and the apples are bubbling beautifully at the edges.",
        "If the topping starts browning too quickly, loosely cover with aluminum foil and continue baking until the center is tender when pierced with a knife.",
        "Let the apple crisp cool for about 10 minutes before serving warm with generous scoops of vanilla ice cream for the ultimate comfort dessert experience."
    ],
    "tips": [
        "Choose firm apples like Golden Delicious, Granny Smith, Honeycrisp, or Fuji to prevent mushy texture during baking",
        "If using tart apples like Granny Smith, increase sugar to 110g or adjust to taste for the perfect sweetness balance", 
        "An apple peeler makes quick work of preparation and ensures uniform slices for even cooking",
        "Room temperature butter creates the best crumb texture - if butter is cold, dice it and let it sit for 30 minutes",
        "You can mix the topping in a stand mixer with paddle attachment until pea-sized crumbs form, but don't overmix",
        "For extra crunch, add chopped walnuts, pecans, or sliced almonds to your crumb topping",
        "Make sure apples are sliced to 6mm thickness for the perfect tender-crisp texture after baking",
        "Cover with foil if topping browns too quickly - the apples need time to become tender and bubbly",
        "The crisp is done when you can easily pierce the apples with a fork and the juices are bubbling at edges",
        "For best results, use a combination of sweet and tart apples for complex, balanced flavor",
        "The vanilla extract in the apple filling adds an extra layer of warmth and sweetness to complement the cinnamon"
    ],
    "notes": [
        "STORAGE: Store covered on the counter for 1 day or refrigerate for 3-5 days. Freeze for up to 3 months, then thaw overnight in refrigerator.",
        "REHEATING: Warm at 175°C for 10-15 minutes until heated through and crispy topping is restored.",
        "APPLE VARIETIES: Golden Delicious, Granny Smith, Fuji, Honeycrisp, Jonagold, Braeburn, and Pink Lady all work beautifully.",
        "SERVING SUGGESTIONS: Drizzle with caramel sauce, serve with Greek yogurt, or top with homemade whipped cream for variety.",
        "VARIATIONS: Add fresh or dried cranberries, experiment with spices like nutmeg or candied ginger, or create a gluten-free version using your favorite flour substitute.",
        "DIFFERENCE FROM OTHER DESSERTS: Apple crisp has a crunchy oat-based topping, while apple crumble is flour-based with sandier texture, and apple cobbler has biscuit-like topping.",
        "SEASONAL TIP: This recipe is perfect for apple picking season and the smaller size makes it ideal for family dinners and smaller gatherings.",
        "PIE PAN PERFECT: This 23cm pie pan size serves 8 people generously, making it perfect for family desserts and intimate dinner parties."
    ]    
}
