{
    "id": 4,
    "title": "Classic British Scones",
    "description": "Authentic British scones are a classic treat to enjoy as part of a traditional 'cream tea' with jam and clotted cream. They are easy to make, wonderfully soft, lightly flaky, and gently sweet. These buttery scones are the perfect indulgent treat that takes you straight to a cozy English tearoom.",
    "image": "images/butter-scones.jpg",
    "time": "35 mins",
    "difficulty": "Medium",
    "category": "Breakfast",
    "youtubeId": "QWgvAEc6RWQ",
    "tags": ["scones", "british", "tea", "butter", "breakfast", "cream tea", "traditional", "afternoon tea"],
    "servings": 6,
    "prepTime": "20 mins",
    "cookTime": "15 mins",
    "totalTime": "35 mins",
    "ingredients": [
        "For the Scones:",
        "350 g all-purpose flour, plus extra for dusting",
        "50 g caster sugar",
        "2 tsp baking powder (8g)",
        "1 tsp salt (4g)",
        "110 g cold unsalted butter, cubed",
        "1 large egg (or see egg-free variation in notes)",
        "200 ml whole milk",
        "1 tsp vanilla extract (5ml)",
        "",
        "For Glazing:",
        "2 tbsp whole milk",
        "",
        "For Serving (Traditional Cream Tea):",
        "Strawberry or raspberry jam",
        "Clotted cream or whipped heavy cream",
        "Hot tea for serving"
    ],
    "instructions": [
        "Preheat your oven to 220°C and line a large baking sheet with parchment paper. This high temperature ensures your scones get that lovely golden rise.",
        "",
        "PREPARING THE DRY INGREDIENTS:",
        "In a large mixing bowl, sift together the all-purpose flour, caster sugar, baking powder, and salt. Sifting helps create lighter, fluffier scones by aerating the flour.",
        "Add the cold, cubed butter to the flour mixture and work quickly to rub it in using your fingertips. Work until the mixture resembles fine breadcrumbs with some slightly larger pieces - this creates those wonderful flaky layers.",
        "",
        "CREATING THE WET MIXTURE:",
        "In a separate bowl, whisk together the egg, milk, and vanilla extract until well combined.",
        "Make a well in the center of your flour mixture and pour in the wet ingredients all at once.",
        "",
        "BRINGING THE DOUGH TOGETHER:",
        "Using a knife or your hands, gently mix the ingredients together until they just come together into a soft dough. The key here is to handle it as little as possible - stop mixing as soon as it holds together.",
        "Don't worry if it looks a bit shaggy; this is exactly what you want for tender scones that will rise beautifully.",
        "",
        "SHAPING THE SCONES:",
        "Turn the dough onto a lightly floured surface and gently press it together without kneading. Pat it out gently to about 2.5 cm thickness - don't roll it too thin or your scones won't be tall enough.",
        "Using a sharp 6 cm round cutter dusted with flour, cut straight down without twisting the cutter. Twisting seals the edges and prevents proper rising.",
        "Place the scones on your prepared baking sheet, ensuring they're almost touching but not overlapping. This helps them rise tall and support each other.",
        "Gather any leftover dough, gently press together, and cut additional scones. These may not be quite as perfect, but they'll still be delicious.",
        "",
        "GLAZING AND BAKING:",
        "Brush the tops gently with milk for a beautiful golden finish.",
        "Bake for 12-15 minutes until risen and golden brown on top. They should sound hollow when tapped on the bottom.",
        "Transfer to a wire rack and let cool for just a few minutes before serving warm - they're best enjoyed fresh from the oven."
    ],
    "tips": [
        "Use cold butter straight from the fridge and cut it into small chunks before rubbing into the flour for the most beautiful flaky texture.",
        "Handle the dough as little as possible since overworking prevents proper rising and creates tough scones.",
        "Work relatively quickly to keep the dough light and ensure your scones achieve that beautiful rise in the oven.",
        "Cut straight down with your cutter rather than twisting, as twisting seals the edges and prevents the scones from rising properly.",
        "Dust your cutter with flour to prevent sticking and make clean, precise cuts through the dough.",
        "Place scones almost touching on the baking sheet so they support each other while rising tall and proud.",
        "Try to cut as close together as possible on the first go to minimize re-rolling the leftover dough.",
        "Don't knead the dough - just press it together gently before flattening to maintain that tender texture.",
        "Brush with milk for a gorgeous golden finish that makes your scones irresistibly beautiful.",
        "Serve immediately while still warm for the most delightful texture and flavor experience.",
        "If making ahead, freeze unbaked scones and bake directly from frozen, adding just 2-3 extra minutes to the baking time."
    ],
    "notes": [
        "TRADITIONAL SERVING: Split scones in half and serve with strawberry jam and clotted cream for an authentic cream tea experience.",
        "THE GREAT DEBATE: In Devon, cream goes on first then jam; in Cornwall, jam goes first then cream. Choose your side wisely!",
        "EGG-FREE TRADITIONAL SCONES: For the most authentic scones, omit eggs entirely and increase milk to 225ml. This creates the traditional British texture that's slightly denser and more crumbly, just as many historic scone recipes were made.",
        "DAIRY SUBSTITUTES: Replace milk with buttermilk for a delightfully tangy flavor, or use plant-based milk like oat or soy for dairy-free scones that everyone can enjoy.",
        "VEGAN VARIATION: Use 110g cold vegan butter, plant milk, and omit eggs completely. Add 1 tablespoon apple cider vinegar to help with that perfect rise.",
        "STORAGE: Store in an airtight container for up to 2 days, then warm gently in a low oven before serving to restore that fresh-baked softness.",
        "SELF-RAISING FLOUR SUBSTITUTE: This recipe uses all-purpose flour plus baking powder for perfect results. If you prefer self-raising flour, use 350g self-raising flour and reduce baking powder to just 1 teaspoon.",
        "TEXTURE TIPS: The perfect scone should be lightly flaky, wonderfully soft, and deliciously buttery - never dense or dry.",
        "AFTERNOON TEA: These scones are a cherished part of traditional afternoon tea alongside delicate finger sandwiches and elegant petit fours.",
        "CLOTTED CREAM: The traditional accompaniment that makes cream tea magical, though whipped heavy cream makes a lovely substitute when clotted cream isn't available.",
        "CULTURAL CONTEXT: Cream tea is a beloved tradition from Devon and Cornwall in Southwest England, though it's now enjoyed with pride throughout Britain.",
        "VARIATIONS: Add 75g sultanas or dried fruit for delightful fruit scones, or try savory versions with cheese and fresh herbs for something completely different.",
        "CUTTING TECHNIQUE: A sharp cutter is absolutely essential since dull edges compress the dough and prevent that beautiful, tall rise.",
        "BAKING POWDER WARNING: Never use more than 2 teaspoons of baking powder with this amount of flour, as excess causes bitter taste and unpleasant over-rising."
    ],
    "nutrition": {
        "calories": 285,
        "fat": "12g",
        "carbs": "42g",
        "protein": "7g",
        "sugar": "8g",
        "fiber": "2g",
        "sodium": "320mg"
    },
    "lastUpdated": "2025-08-12",
    "version": "2.0"
}
