{
    "id": 5,
    "title": "Easy 2-Ingredient Chocolate Fudge",
    "description": "Indulge your sweet tooth and elevate your dessert game with this delectably simple fudge recipe! This mouthwateringly creamy treat requires just three simple ingredients, with sweetened condensed milk taking center stage as the secret to its luscious texture. A universally adored treat that's super easy to create, making it perfect for kitchen novices and experienced bakers alike.",
    "image": "images/chocolate-fudge.jpg",
    "time": "3+ hours",
    "difficulty": "Easy",
    "category": "Desserts",
    "youtubeId": "72FB34E1zYs",
    "tags": ["chocolate", "fudge", "easy", "dessert", "gift", "condensed milk", "3-ingredient", "no-thermometer"],
    "servings": 18,
    "prepTime": "10 mins",
    "cookTime": "5 mins",
    "chillTime": "3 hours",
    "totalTime": "3 hours 15 mins",
    "ingredients": [
        "360g semi-sweet chocolate chips (or chopped chocolate)",
        "1 can (300ml) sweetened condensed milk", 
        "(optional) 1 tsp vanilla extract"
    ],
    "instructions": [
        "Line a 15×10 cm rectangular baking dish with parchment paper, ensuring the bottom and sides are completely covered and excess hangs over the edges for easy removal.",
        "",
        "MELTING THE CHOCOLATE:",
        "Add the chocolate chips and sweetened condensed milk to a medium saucepan.",
        "Place over low heat and cook, stirring constantly with a wooden spoon, until the chocolate melts completely and the mixture becomes smooth and thick, approximately 5 minutes.",
        "Remove from heat and gently stir in the vanilla extract if you're using it.",
        "",
        "SETTING THE FUDGE:",
        "Pour the silky chocolate mixture into your prepared pan and smooth it evenly with a spatula or the back of a spoon.",
        "Set aside to cool completely and firm up for about 3 hours at room temperature, or chill in the refrigerator for 2 hours for faster results.",
        "",
        "CUTTING AND SERVING:",
        "When your fudge has set perfectly, remove the entire slab from the baking dish by lifting the parchment paper, using the excess edges as convenient handles.",
        "Peel away the parchment paper and cut the fudge into neat squares with a sharp knife.",
        "Enjoy the fudge immediately for the ultimate indulgence, or wrap individual pieces in parchment or wax paper and store in an airtight container for up to two weeks."
    ],
    "tips": [
        "Use low heat consistently and resist the temptation to increase to medium heat for faster results, as this risks overheating the chocolate and causing the mixture to break.",
        "Choose chopped bar chocolate over chips when possible, as it melts more smoothly than chocolate chips, which contain stabilizers designed to help them hold their shape in cookies.",
        "Stir constantly with a wooden spoon to ensure smooth, even melting and prevent the delicate mixture from burning or seizing.",
        "For perfectly clean cuts, warm your knife under hot running water, then dry it thoroughly before making each slice through the fudge.",
        "Get creative with chocolate varieties by swapping in white chocolate chips, milk chocolate, dark chocolate, or even vegan chocolate to suit your preferences.",
        "Create nutty fudge by stirring in 125g of toasted, chopped walnuts or pecans along with the vanilla extract for delightful texture and flavor.",
        "Experiment with different extracts to create exciting flavor combinations - try mint extract for refreshing peppermint fudge or coffee extract for rich mocha fudge.",
        "Add wonderful texture and visual appeal by stirring in toasted nuts, colorful sprinkles, cookie bits, crushed peppermint candies, dried fruit, or chopped pretzels before the fudge sets.",
        "Transform your fudge into festive shapes by using small cookie cutters to create seasonally appropriate designs like trees for Christmas or hearts for Valentine's Day.",
        "Always use sweetened condensed milk rather than evaporated milk, as these two ingredients behave completely differently and cannot be substituted for one another.",
        "Unlike traditional fudge recipes that require precise temperature monitoring, this method uses sweetened condensed milk for foolproof results without needing a candy thermometer."
    ],
    "notes": [
        "STORAGE: Store your finished fudge in an airtight container at room temperature for about one week, or refrigerate for up to two weeks to extend its shelf life significantly.",
        "FREEZING: Wrap the fudge well in several layers of plastic wrap to prevent freezer burn, then freeze for up to six months. To serve, allow it to defrost in the refrigerator for a minimum of three hours.",
        "REFRIGERATION: While refrigeration isn't necessary, storing your fudge in the refrigerator will extend its freshness and shelf life considerably.",
        "RECIPE FLEXIBILITY: This wonderfully adaptable recipe serves as a blank canvas for your favorite toppings or crunchy mix-ins, offering endless creative possibilities.",
        "CHOCOLATE VARIETIES: Feel free to experiment by swapping in white chocolate chips, milk chocolate, dark chocolate, or even vegan chocolate to suit different dietary needs and taste preferences.",
        "FLAVOR COMBINATIONS: Create exciting variations like chocolate peppermint fudge with mint extract, or rich mocha fudge with coffee extract for sophisticated flavor profiles.",
        "TEXTURE ADD-INS: Enhance your fudge by stirring in toasted nuts, colorful sprinkles, cookie pieces, crushed peppermint candies, dried fruit, or chopped pretzels before the mixture sets.",
        "PRESENTATION IDEAS: Elevate the visual appeal by sprinkling beautiful toppings on top of the fudge before it sets, or use cookie cutters to create charming seasonal shapes.",
        "NO CANDY THERMOMETER NEEDED: Unlike traditional fudge recipes that require boiling sugar to the precise 'soft ball' stage, this simplified method uses sweetened condensed milk for consistently perfect results.",
        "PERFECT FOR GIFTING: This delicious fudge makes wonderful homemade gifts during the holiday season or for any special occasion throughout the year.",
        "KITCHEN NOVICE FRIENDLY: This foolproof recipe promises perfectly creamy fudge with hassle-free preparation that even complete beginners can master with confidence.",
        "PAN SIZE FLEXIBILITY: Use any similar-sized small pan for this recipe - a 15×10 cm rectangular dish provides the ideal thickness for cutting into perfectly proportioned squares."
    ],
    
    "lastUpdated": "2025-08-12",
    "version": "3.0"
}
