{
    "id": 2,
    "title": "The Best, Easiest Focaccia Bread (Overnight Method)",
    "description": "Cold, refrigerated dough is the magical secret to creating incredibly delicious focaccia that will make your kitchen smell absolutely divine! This wonderfully simple 4-ingredient recipe requires only 5 minutes of hands-on time and yields the most extra-pillowy, airy focaccia with a gorgeous golden, olive oil-crusted exterior. The long, cold fermentation creates amazing depth of flavor and texture that will have everyone asking for your secret.",
    "image": "images/focaccia-bread.jpg",
    "time": "4-48 hours (mostly hands-off)",
    "difficulty": "Easy",
    "category": "Bread",
    "youtubeId": "UI7KidsTbLI",
    "tags": ["bread", "italian", "no-knead", "high-hydration", "cold-fermentation", "olive oil", "rosemary", "artisan", "toppings"],
    "servings": 8,
    "prepTime": "5 mins active",
    "restTime": "1-48 hours cold rise + 2-4 hours final rise",
    "cookTime": "25-30 mins",
    "lastUpdated": "2025-08-12",
    "version": "2.0",
    "defaultUnits": "metric",
    "ingredients": [
        "For the Dough (4 ingredients only!):",
        "256g  all-purpose or bread flour",
        "5g kosher salt",
        "5g yeast ",
        "225g lukewarm water",
        "",
        "For Assembly & Baking:",
        "30ml extra virgin olive oil, divided",
        "Butter for greasing (if using glass dishes)",
        "Flaky sea salt (Maldon preferred)",
        "",
        "Classic Topping Options (choose one or mix!):",
        "1-2 tsp fresh rosemary leaves",
        "150g cherry tomatoes, halved",
        "100g Kalamata or green olives, pitted and halved",
        "1 medium red onion, thinly sliced",
        "2-3 garlic cloves, thinly sliced",
        "100g sun-dried tomatoes, chopped",
        "50g pine nuts",
        "Fresh thyme or oregano leaves",
        "Crumbled feta or goat cheese (add after baking)",
        "",
        "Equipment Needed:",
        "Large mixing bowl",
        "Rubber spatula",
        "One 20-23cm (8-9 inch) pie plate OR one 20x20cm (8x8 inch) pan OR one 23x33cm (9x13 inch) sheet pan",
        "Bowl cover, plastic wrap, or damp tea towel"
    ],
    "instructions": [
        "DAY 1 - MAKE THE MAGICAL DOUGH (5 minutes active time):",
        "In a large bowl, whisk together 256g flour, 5g salt, and 5g instant yeast until everything is beautifully combined.",
        "Add 225g lukewarm water all at once. Using a rubber spatula, mix gently until the liquid is completely absorbed and the ingredients form a sticky, shaggy dough ball. Don't worry if it looks rough and messy - this is exactly what we want!",
        "Generously coat the entire surface of the dough with olive oil, making sure it's lovingly slicked all over. This precious step prevents a crusty skin from forming during the long, transformative rise.",
        "Cover the bowl tightly with a lid, plastic wrap, or damp tea towel. If you're using a tea towel, secure it with a rubber band to create a more airtight seal.",
        "Transfer to the refrigerator immediately and let it cold-ferment for at least 12 hours, but preferably 18-48 hours. The longer it rests, the more incredible flavor develops - patience truly pays off here!",
        "For same-day focaccia: Short on time? You can absolutely skip the overnight rise: Simply let the dough rise at room temperature until doubled (about 1.5-2 hours), then proceed with the recipe. Your final rise will only take about 30 minutes.",
        "",
        "DAY 2 - PREPARE FOR BAKING MAGIC:",
        "Remove the dough from the refrigerator and marvel at how it should be visibly risen, wonderfully bubbly, and smelling absolutely divine with that yeasty aroma.",
        "Prepare your pan with love: Line a 20-23cm (8-9 inch) pie plate or 20x20cm (8x8 inch) square pan with parchment paper, or grease thoroughly with butter (this is absolutely essential for glass dishes).",
        "Pour 15ml olive oil into the center of your prepared pan, creating a golden pool.",
        "Gently perform a light stretch and fold using your hands or a silicone spatula - treat the dough kindly, as it's about to become something wonderful.",
        "Place the dough into your prepared pan and gently roll it in the oil to coat completely. This beautiful oil coating prevents sticking and creates that gorgeous golden crust we're after.",
        "Let the dough rest peacefully at room temperature for 2-4 hours (timing depends on your kitchen's warmth) until it spreads to fill most of the pan and looks beautifully puffy. No need to cover during this final rise.",
        "",
        "BAKE THE FOCACCIA TO PERFECTION:",
        "Preheat your oven to 220°C with a rack positioned in the middle, creating the perfect baking environment.",
        "Now for the fun part - choose your toppings! If using rosemary, sprinkle it evenly over the surface. For tomatoes, place halved cherry tomatoes cut-side up. For olives, distribute them evenly. For onions or garlic, scatter the thin slices across the surface.",
        "Pour the remaining 15ml olive oil over the dough and any toppings. The oil should pool slightly on top, creating that signature focaccia shimmer.",
        "Lightly coat your hands with the pooled oil, then use all your fingertips to press straight down into the dough, creating those characteristic deep dimples all the way to the bottom of the pan. This creates the signature focaccia texture that holds all the delicious flavors!",
        "If needed, gently stretch the dough as you dimple to help it fill the entire pan beautifully.",
        "Generously sprinkle flaky sea salt all over the surface - don't be shy with this final flourish, as it adds incredible flavor and texture contrast!",
        "If using cheese toppings like feta or goat cheese, wait to add these until after baking to prevent burning.",
        "Immediately transfer to the preheated oven and bake for 25-30 minutes, until the top is gorgeously golden brown and the bottom sounds hollow when gently tapped.",
        "Remove from the oven and transfer the focaccia to a cooling rack immediately to keep it crispy. Add any post-baking toppings like fresh cheese now. Let it cool for at least 10 minutes before cutting to allow the flavors to settle. For sandwich use, let it cool completely first."
    ],
    "tips": [
        "Plan ahead for the most incredible results - mixing the dough the day before you want to bake allows the cold fermentation to work its magic, creating unparalleled flavor and texture.",
        "Embrace the high hydration (88%) as it's the key to those gorgeous air pockets throughout your focaccia - resist the temptation to add more flour even if the dough seems very wet initially.",
        "Be generous when slicking that dough with olive oil before refrigerating - this loving step prevents a crusty skin from forming during the long, transformative rise.",
        "For the best results, use instant yeast (SAF brand is highly recommended). If you only have active dry yeast, dissolve it in the lukewarm water first and let it foam for 15 minutes before proceeding.",
        "When using glass baking dishes, always grease with butter first, then add your olive oil - this double protection prevents any sticking whatsoever.",
        "The longer you allow the cold fermentation (up to 3 days!), the more complex and absolutely delicious the flavor becomes - think of it as an investment in taste.",
        "Don't skimp on the generous dimpling step - press your fingertips confidently all the way down to create those characteristic deep pockets that hold all the wonderful flavors.",
        "Invest in the best quality extra virgin olive oil you can afford - since it's such a prominent flavor in focaccia, it truly makes a remarkable difference.",
        "Flaky sea salt on top is absolutely essential - Maldon or similar coarse salt creates that perfect finishing touch and delightful texture contrast.",
        "For sandwich-style focaccia, use a 23x33cm (9x13 inch) sheet pan to create a thinner loaf that's absolutely perfect for slicing horizontally into sandwich layers.",
        "Topping success secrets: Always brush wet toppings like tomatoes and onions lightly with olive oil to prevent burning, and add delicate items like fresh herbs or cheese after baking for the best results."
    ],
    "notes": [
        "Why this recipe works so beautifully: The high hydration (88% water to flour ratio) creates that wonderfully light, airy texture with gorgeous holes throughout the crumb that makes focaccia so special.",
        "The fascinating science behind cold fermentation: During the long, slow rise, enzymes in both the flour and yeast break down starches into simple sugars, contributing incredible depth to both flavor and that beautiful golden browning. No added sugar needed!",
        "This is a wonderfully forgiving no-knead recipe - the extended fermentation develops gluten naturally, creating perfect structure and delightful chewiness without any strenuous kneading.",
        "Storage made simple: Keep your focaccia at room temperature for up to 3 days in an airtight container, or freeze for up to 3 months. To revive the crust, simply reheat at 180°C for 15 minutes.",
        "Short on time? You can absolutely skip the overnight rise: Simply let the dough rise at room temperature until doubled (about 1.5-2 hours), then proceed with the recipe. Your final rise will only take about 30 minutes.",
        "Pan variations for every occasion: 20-23cm (8-9 inch) pie plates create charming round focaccias. One 20x20cm (8x8 inch) pan makes a delightfully thick focaccia. One 23x33cm (9x13 inch) sheet pan creates thin focaccia perfect for sandwich making.",
        "Perfect salt ratio: Use 2% of flour weight in salt (5g for 256g flour). Start with slightly less if you're particularly salt-sensitive, keeping in mind that you'll be adding lovely flaky salt on top as well.",
        "Topping creativity guide: Start simple with just olive oil and salt for classic perfection. Add fresh rosemary for aromatic bliss, halved cherry tomatoes for bursts of sweetness, or pitted olives for Mediterranean flair. Thinly sliced red onions add wonderful sharpness, while garlic brings aromatic depth. Sun-dried tomatoes and pine nuts create gourmet elegance, and post-baking additions like crumbled feta or goat cheese add creamy richness.",
        "Topping application secrets: Always coat fresh toppings lightly with olive oil to prevent burning and ensure even cooking. Add delicate herbs and soft cheeses after baking to preserve their fresh flavors and prevent overcooking."
    ]
}
