{
    "id": 1,
    "title": "Tangzhong Cinnamon Rolls (Overnight Method)",
    "description": "These incredibly soft and tender cinnamon rolls use the magical tangzhong technique to create the most pillowy texture you've ever experienced! This recipe includes both hand and stand mixer methods, making a perfect batch of 8 large rolls (10cm) or 12 smaller rolls (7cm). The beautiful swirls and fluffy texture will stay amazingly soft for up to a week.",
    "image": "images/cinnamon-rolls.jpg",
    "time": "12+ hours (overnight)",
    "difficulty": "Hard",
    "category": "Breakfast",
    "youtubeId": "4MV8QYd5sOg",
    "tags": ["cinnamon", "rolls", "overnight", "tangzhong", "breakfast", "sweet", "soft", "long-lasting"],
    "servings": "8-12 rolls",
    "prepTime": "30 mins",
    "restTime": "overnight + 2 hrs",
    "cookTime": "25 mins",
    "lastUpdated": "2025-08-11",
    "version": "2.0",
    "ingredients": [
        "For Tangzhong (Night Before):",
        "25g all-purpose flour",
        "120g milk",
        "",
        "For Dough:",
        "260g all-purpose flour",
        "25g sugar",
        "5g salt",
        "5g yeast",
        "2 large eggs", 
        "15ml oil",
        "60g softened butter (cubed)",
        "",
        "For Filling:",
        "40g softened butter",
        "10g ground cinnamon",
        "25g white sugar",
        "45g brown sugar",
        "",
        "For Frosting:",
        "45g softened butter",
        "80g softened cream cheese",
        "125g icing sugar",
        "5ml vanilla extract",
        "optional: 1-2 tbsp milk (to thin out frosting)",
        "",
        "Tools Needed:",
        "Stand mixer (with dough hook) or strong arms + wooden spoon",
        "Rolling pin + ruler",
        "Parchment paper",
        "8x8-inch (20x20cm) or 9x13-inch (23x33cm) baking pan"
    ],
    "instructions": [
        "NIGHT BEFORE - TANGZHONG:",
        "In a small pot, whisk together 25g flour and 120g milk until completely smooth. Cook over medium heat, stirring constantly, until the mixture thickens to a mashed potato consistency (about 3 minutes). Let it cool completely before using in your dough.",
        "",
        "MAKE DOUGH - Stand Mixer Method:",
        "In your mixer bowl, combine the cooled tangzhong, 260g flour, 45g brown sugar, 5g salt, 5g yeast, 2 eggs, and 15ml oil. Mix on low speed until everything comes together (about 10 to 15 minutes). Test the dough's readiness using the windowpane test before adding butter.",
        "Divide your 100g softened butter into 6-10 small pieces. Add the butter gradually while mixing, waiting for each piece to fully incorporate before adding the next. Knead on medium speed for 8-15 minutes until the dough becomes smooth and stretchy. Check for readiness using the windowpane test again.",
        "",
        "MAKE DOUGH - Hand Method:",
        "In a large bowl, combine the tangzhong, 260g flour, 45g brown sugar, 5g salt, 5g yeast, 2 eggs, and 15ml oil. Knead on your countertop until everything is well combined (about 10 to 25 minutes). Check for readiness using the windowpane test. Don't worry if the dough feels very sticky at first - this is normal! Let it rest for a few minutes between kneading sessions if your arms get tired.",
        "Divide your 100g softened butter into 6-10 small pieces. Add the butter piece by piece, working it in thoroughly. Use the slap and fold technique: grab the dough, slap it onto the counter, then fold it over itself. Repeat this process until the butter is fully incorporated and the dough becomes smooth, elastic, and less sticky. Knead with your hands for 10 to 20 minutes untill smooth and bouncy, check for readiness using the windowpane test.",
        "",
        "FIRST RISE (Overnight):",
        "Cover the bowl with plastic wrap and let the dough sit at room temperature for 30 to 45 minutes, until it's just before doubling in size. Then transfer it to the refrigerator and let it rest for 8-12 hours. (Winter tip: If your kitchen is particularly cold, let the dough rise in an oven with just the light on for 1 hour before refrigerating.)",
        "",
        "MAKE FILLING (Night Before):",
        "Mix together 40g very soft butter, 10g cinnamon, 25g white sugar, and 45g brown sugar until you have a thick, spreadable paste. Cover and leave at room temperature so it's ready to use in the morning.",
        "",    
        "MAKE FROSTING (Night Before or during baking):",
        "In a bowl, mix together 45g softened butter, 80g softened cream cheese, 125g icing sugar, and 5ml vanilla extract until completely smooth. If the frosting seems too thick, add 1-2 tablespoons of milk to reach your desired consistency.",
        "Cover and leave at room temperature until ready to use.",
        "",
        "NEXT MORNING - Shape the Rolls:",
        "Take the dough from the refrigerator and let it sit for 15 minutes to warm up slightly. Roll it into a rectangle: For 12 small rolls, aim for 30cm width × 45cm length. For 8 larger rolls, roll to 25cm width × 45cm length.",
        "Spread the filling paste evenly across the surface, leaving a 2cm border empty at the top edge to help with sealing.",
        "",
        "ROLL & CUT:",
        "Start rolling from the short side to create more swirls. Cut with a sharp knife or dental floss: For 8 large rolls, make slices about 3cm wide. For 12 smaller rolls, make slices about 2.5cm wide.",
        "",
        "SECOND RISE:",
        "Place the rolls on a parchment-lined baking pan with the cut side facing up. Cover with a clean kitchen towel or plastic wrap. Let them rise until they're puffy and almost doubled in size (about 1 hour), with the sides just touching each other. (Winter tip: Place the pan in a warm oven with just the light on, or set a bowl of hot water on the bottom rack.)",
        "",
        "BAKE & FINISH:",
        "Preheat your oven to 180°C (350°F). Bake the rolls for 20-25 minutes until they're beautifully golden brown on top.",
        "Remove from the oven and place on a cooling rack. If you want to enjoy them immediately, spread the frosting on the warm rolls after they've cooled for 5-10 minutes. Otherwise, let the rolls cool completely and store them in an airtight container before frosting as desired."
    ],
    "tips": [
        "Use bread flour for superior structure - bread flour (12.7% protein) is highly recommended, but high-quality all-purpose flour will work beautifully too.",
        "Choose cultured, salted butter from grass-fed cows for unbeatable flavor - Kerrygold is widely available and reasonably priced for exceptional results.",
        "Use 10% half-and-half or whole milk to enrich the dough perfectly - please don't substitute with lower-fat alternatives as they won't give you the same luxurious texture.",        
        "Want more swirls? Roll the dough with the width facing you (the shorter side creates tighter, more dramatic spirals).",
        "For clean, professional cuts, use dental floss to slice through the dough without squishing those beautiful swirls you worked so hard to create.",
        "Cold dough is much easier to roll out evenly - don't skip the 15-minute rest period after taking it from the refrigerator.",
        "Make your filling the night before so it's perfectly ready when you need it - this saves precious time in the morning rush.",
        "For the best-quality cream cheese frosting, always use full-fat block-style cream cheese rather than the spreadable variety."
    ],
    "notes": [
        "What is tangzhong? It's a simple paste made by whisking flour and liquid together, then heating until the starches gelatinize at 65°C (149°F). This magical technique transforms ordinary bread dough.",
        "Why tangzhong works so well: It creates super-hydrated dough that's surprisingly easy to work with and retains moisture far longer than traditional methods.",
        "These rolls will stay incredibly soft for up to a week - much longer than traditional cinnamon rolls, making them perfect for meal prep or gift-giving.",        
        "The tangzhong technique derives from the Japanese yudane method and was popularized by Taiwanese author Yvonne Chen's 2007 cookbook. The technique spread throughout East Asia before gaining worldwide recognition.",
        "Use a neutral oil like safflower, canola, or sunflower oil to lightly grease your work surface before rolling if the dough seems to stick."        
    ],
    "nutrition": {
        "calories": 385,
        "fat": "12g",
        "carbs": "65g",
        "protein": "7g",
        "sugar": "32g"
    }
}
