{
    "id": 6,
    "title": "Ultimate Traditional Vanilla Fudge",
    "description": "This is the classic five-ingredient vanilla fudge that you'll want to make over and over again! Unlike simple condensed milk 'cheats' fudge, this authentic traditional method creates the perfect texture and flavor that reminds you of those classic fudge shops in Cornwall. With proper temperature control and beating technique, you'll achieve that distinctive grainy-smooth texture and rich vanilla flavor that defines proper homemade fudge.",
    "image": "images/vanilla-fudge.jpg",
    "time": "2 hours 30 mins",
    "difficulty": "Bit Tricky",
    "category": "Desserts",
    "youtubeId": "D1K3mp7lZKA",
    "tags": ["fudge", "traditional", "condensed milk", "homemade gift", "classic", "carnation"],
    "servings": 25,
    "prepTime": "15 mins",
    "cookTime": "25 mins",
    "chillTime": "2 hours",
    "totalTime": "2 hours 40 mins",
    "ingredients": [
        "300ml Carnation Condensed Milk (equivalent to 397g can)",
        "450g light brown soft sugar",
        "150ml double cream (or half and half 10% fat)",
        "100g unsalted butter",
        "2 tsp vanilla bean paste (or vanilla extract)",
        "",
        "Optional Add-ins:",
        "Chopped nuts (walnuts or pecans)",
        "Extra vanilla flavorings",
        "Small pieces of biscuits or chocolate"
    ],
    "instructions": [
        "Line a 20cm square tin (or 18×25cm for thinner pieces) with baking parchment, ensuring the paper hangs over the edges for easy removal.",
        "",
        "MELTING AND DISSOLVING:",
        "Add the condensed milk, light brown sugar, double cream, and butter to a heavy-based saucepan.",
        "Stir gently over low heat until the sugar has completely dissolved and the butter has melted - this step is crucial for achieving a perfectly smooth texture.",
        "Make sure there are no sugar granules remaining, as any undissolved sugar will affect the final texture of your fudge.",
        "",
        "BOILING TO SOFT BALL STAGE:",
        "Bring the mixture to a rolling boil, stirring constantly to prevent the mixture from catching on the bottom of the pan.",
        "Continue boiling while stirring continuously until the mixture reaches 118°C on a sugar thermometer.",
        "If you don't have a thermometer, test by dropping a small amount into ice-cold water - it should form a soft ball that holds its shape but remains pliable.",
        "",
        "COOLING AND FLAVORING:",
        "Remove the pan from heat and let it sit for exactly 5 minutes to cool slightly - this timing is important for the perfect texture.",
        "Stir in the vanilla bean paste or vanilla extract thoroughly, ensuring it's evenly distributed throughout the mixture.",
        "",
        "THE CRITICAL BEATING STAGE:",
        "Pour the mixture into a large bowl (or keep it in the pan) and beat vigorously for 5+ minutes with an electric mixer on medium-high speed, or 8-10+ minutes by hand.",
        "The mixture will visibly thicken and start to lose its glossy shine - be patient and trust this magical transformation process!",
        "Stop beating when the fudge holds its shape beautifully and is no longer pourable.",
        "",
        "SETTING:",
        "Pour the thick fudge into your lined tin and smooth the surface gently with a spatula.",
        "Leave to set at room temperature for several hours, or place in the refrigerator for faster setting.",
        "Cut into perfect squares when completely set and enjoy your homemade masterpiece!"
    ],
    "tips": [
        "A thermometer is essential for success - use a thermapen or simple jam/sugar thermometer to ensure perfect accuracy every time.",
        "Use a heavy-based saucepan to prevent hot spots and ensure even heating throughout the entire cooking process.",
        "Light brown soft sugar works best for achieving the ideal texture, color, and flavor - avoid substituting with other sugars.",
        "Stir constantly during the boiling stage to prevent the mixture from catching and burning on the bottom of the pan.",
        "The 118°C temperature is absolutely critical - this is the soft ball stage that creates the perfect fudge texture.",
        "If you don't have a thermometer, use the reliable ice-water test: drop a small amount into ice-cold water and it should form a soft ball.",
        "Let the mixture sit for exactly 5 minutes after reaching temperature - this cooling period is crucial for achieving proper texture.",
        "Use vanilla bean paste for beautiful vanilla flecks, or choose high-quality vanilla extract for pure, intense flavor.",
        "Beat for the full time stated - 5+ minutes with an electric mixer or 8-10+ minutes by hand until the mixture is visibly thickened.",
        "The mixture will transform dramatically from glossy and pourable to thick and matte - trust this amazing process!",
        "Don't add any extras until after the beating stage to prevent them from melting due to residual heat.",
        "This delicious fudge will last 2+ weeks at room temperature and freezes beautifully for 3+ months."
    ],
    "notes": [
        "CLASSIC VS CHEATS FUDGE: This is authentic traditional fudge, not the simple condensed milk 'cheats' version - it requires more technique but delivers superior texture and flavor that's absolutely worth the effort.",
        "CORNWALL INSPIRATION: This recipe recreates the classic fudge texture you'd find in traditional fudge shops, especially those iconic Cornwall holiday destinations that hold such sweet memories.",
        "FIVE INGREDIENT SIMPLICITY: Despite being traditional, this recipe uses just five core ingredients, proving that quality technique matters far more than complexity.",
        "TEMPERATURE IS CRITICAL: If your fudge doesn't set properly, it likely wasn't boiled to the correct temperature (118°C) or beaten long enough - these steps are vitally important for success.",
        "VANILLA BEAN PASTE PREFERENCE: Jane recommends vanilla bean paste over extract for the beautiful flecks of vanilla that show throughout the finished fudge.",
        "BEATING TECHNIQUE: You can beat by hand (8-10+ minutes) or use an electric mixer (5+ minutes on medium-high speed) - both methods work perfectly well.",
        "VISUAL CUES: The fudge will visibly thicken during beating and stop being pourable when it's ready - trust this wonderful transformation process.",
        "STORAGE EXCELLENCE: This delicious fudge lasts 2+ weeks at room temperature and freezes beautifully for 3+ months without losing quality.",
        "FLAVOR VARIATIONS: While this recipe is vanilla-focused, you could substitute with lemon, orange, or other high-quality concentrated flavorings for variety.",
        "TEXTURE PREFERENCE: Light brown soft sugar is specifically chosen for the best texture, color, and flavor - avoid substituting for optimal results.",
        "EQUIPMENT MATTERS: Use block butter (not margarine) and double cream for the proper fat content that ensures perfect setting every time.",
        "TRUST THE PROCESS: Be patient during the beating stage - it takes time but the magical transformation is absolutely worth it!"
    ],
    "nutrition": {
        "calories": 165,
        "fat": "4g",
        "carbs": "32g",
        "protein": "2g",
        "sugar": "30g",
        "fiber": "0g",
        "sodium": "25mg"
    },
    "lastUpdated": "2025-08-12",
    "version": "2.0"
}
